TriodeGirl/RA4M1_Arduino_UNO-R4_Processor_Direct_Register_Addressing_Defines/susan_ra4m1_minima_register_defines.h
#define SYSTEM_SLCDSCKCR    ((volatile unsigned char *)(SYSTEM + 0xE050))  // Segment LCD Source Clock Control Register
#define SLCDSCKCR_LCDSCKSEL_2_0  0  // LCD Source Clock Select; 000: LOCO, 001: SOSC, 010: MOSC, 100: HOCO
#define SLCDSCKCR_LCDSCKEN       7  // LCD Source Clock Out Enable; 0: LCD source clock out disabled, 1: LCD source clock out enabled

#define SYSTEM_MOCOUTCR   ((volatile unsigned char *)(SYSTEM + 0xE061))  // MOCO User Trimming Control Register
#define MOCOUTCR_MOCOUTRM_7_0   0  // MOCO User Trimming - See: 8.2.21
#define SYSTEM_HOCOUTCR   ((volatile unsigned char *)(SYSTEM + 0xE062))  // HOCO User Trimming Control Register
#define HOCOUTCR_HOCOUTRM_7_0   0  // HOCO User Trimming - See: 8.2.21

#define SYSTEM_MOSCWTCR ((volatile unsigned char *)(SYSTEM + 0xE0A2))  // Main Clock Oscillator Wait Control Register
#define MOSCWTCR_MSTS_3_0   0   // Main Clock Oscillator Wait Time Setting
#define SYSTEM_HOCOWTCR ((volatile unsigned char *)(SYSTEM + 0xE0A5))  // High-Speed On-Chip Oscillator Wait Control Register
#define HOCOWTCR_MSTS_2_0   0   // HOCO Wait Time Setting

#define SYSTEM_USBCKCR  ((volatile unsigned char *)(SYSTEM + 0xE0D0))  // USB Clock Control Register
#define USBCKCR_USBCLKSEL   0   // USB Clock Source Select; 0: PLL (value after reset), 1: HOCO

#define SYSTEM_MOMCR    ((volatile unsigned char *)(SYSTEM + 0xE413))  // Main Clock Oscillator Mode Oscillation Control Register
#define MOMCR_MODRV1        3   // Main Clock Oscillator Drive Capability 1 Switching; 0: 10 MHz to 20 MHz, 1: 1 MHz to 10 MHz
#define MOMCR_MOSEL         6   // Main Clock Oscillator Switching; 0: Resonator, 1: External clock input

#define SYSTEM_SOSCCR   ((volatile unsigned char *)(SYSTEM + 0xE480))  // Sub-Clock Oscillator Control Register
#define SOSCCR_SOSTP        0   // Sub-Clock Oscillator Stop; 0: Operate the sub-clock oscillator, 1: Stop the sub-clock osc
#define SYSTEM_SOMCR    ((volatile unsigned char *)(SYSTEM + 0xE481))  // Sub-Clock Oscillator Mode Control Register
#define SOMCR_SODRV_1_0     0   // Sub-Clock Oscillator Drive Capability Switching; 00: Normal, 01: Low-power 1, 10: Low-power 2, 11: Low-power 3

#define SYSTEM_LOCOCR   ((volatile unsigned char *)(SYSTEM + 0xE490))  // Low-Speed On-Chip Oscillator Control Register
#define LOCOCR_LCSTP        0   // LOCO Stop; 0: Operate the LOCO clock, 1: Stop the LOCO clock
#define SYSTEM_LOCOUTCR ((volatile unsigned char *)(SYSTEM + 0xE492))  // LOCO User Trimming Control Register
#define LOCOUTCR_LOCOUTRM_7_0   0  // LOCO User Trimming - See: 8.2.20

// Reset Status
#define SYSTEM_RSTSR0   ((volatile unsigned char *)(SYSTEM + 0xE410))  // Reset Status Register 0
#define RSTSR0_PORF         0    // Power-On Reset Detect Flag
#define RSTSR0_LVD0RF       1    // Voltage Monitor 0 Reset Detect Flag
#define RSTSR0_LVD1RF       2    // Voltage Monitor 1 Reset Detect Flag
#define RSTSR0_LVD2RF       3    // Voltage Monitor 2 Reset Detect Flag
#define SYSTEM_RSTSR1   ((volatile unsigned char *)(SYSTEM + 0xE0C0))  // Reset Status Register 1
#define RSTSR1_IWDTRF       0    // Independent Watchdog Timer Reset Detect Flag
#define RSTSR1_WDTRF        1    // Watchdog Timer Reset Detect Flag
#define RSTSR1_SWRF         2    // Software Reset Detect Flag
#define SYSTEM_RSTSR2   ((volatile unsigned char *)(SYSTEM + 0xE411))  // Reset Status Register 2
#define RSTSR2_CWSF         0    // Cold/Warm Start Determination Flag - 0: Cold start, 1: Warm start

// Flash Memory
#define FCACHE_FCACHEE  ((volatile unsigned short *)(SYSTEM + 0xC100))  // Flash Cache Enable Register
#define FCACHEE_FCACHEEN    0    // FCACHE Enable - 0: Disable FCACHE, 1: Enable FCACHE.
#define FCACHE_FCACHEIV ((volatile unsigned short *)(SYSTEM + 0xC100))  // Flash Cache Invalidate Register
#define FCACHEIV_FCACHEIV   0    // Flash Cache Invalidate - 0: Do not invalidate, 1: Invalidate
#define FLCN_DFLEN      ((volatile unsigned char  *)(SYSTEM + 0xC090))  // Data Flash Control Resister
#define DFLEN_DFLEN         0    // Data Flash Access Enable - 0: Access is disabled, 1: Access is enabled


// System Control Block - for Software initiated reset, e.g. needed to reinitialse USB with PC
#define SCBBASE 0xE0000000
#define SCB_AIRCR                  ((volatile unsigned int *)(SCBBASE + 0xED0C))
#define SCB_AIRCR_VECTKEY_Pos      16U                                   // SCB AIRCR: VECTKEY Position
#define SCB_AIRCR_SYSRESETREQ_Pos  2U                                    // SCB AIRCR: SYSRESETREQ Position
#define SCB_AIRCR_SYSRESETREQ_Msk  (1UL << SCB_AIRCR_SYSRESETREQ_Pos)    // SCB AIRCR: SYSRESETREQ Mask
//
// *SCB_AIRCR = ((0x5FA << SCB_AIRCR_VECTKEY_Pos) | SCB_AIRCR_SYSRESETREQ_Msk);
//
// From: https://mcuoneclipse.com/2015/07/01/how-to-reset-an-arm-cortex-m-with-software/


// ==== Clock Frequency Accuracy Measurement Circuit (CAC) ====
#define CACBASE 0x40040000 //
#define CAC_CACR0       ((volatile unsigned char *)(CACBASE + 0x4600))  // CAC Control Register 0
#define CACR0_CFME          0   // Clock Frequency Measurement Enable; 0: Disable, 1: Enable
#define CAC_CACR1       ((volatile unsigned char *)(CACBASE + 0x4601))  // CAC Control Register 1
#define CACR1_CACREFE       0   // CACREF Pin Input Enable; 0: Disable, 1: Enable
#define CACR1_FMCS_2_0      1   // Measurement Target Clock (MTC) Select; 0b010: HOCO clock
#define CACR1_TCSS_1_0      4   // MTC Freq Div Ratio Select; 0b00: None, 0b01: ×1/4 clock, 0b10: ×1/8 clock, 0b11: ×1/32 clock
#define CACR1_EDGES_1_0     6   // Valid Edge Select; 0b00: Rising edge, 0b01: Falling edge, 0b10: Both rising and falling edges
#define CAC_CACR2       ((volatile unsigned char *)(CACBASE + 0x4602))  // CAC Control Register 2
#define CACR2_RPS           0   // Reference Signal Select; 0: CACREF pin input, 1: Internal clock (internally generated signal)
#define CACR2_RSCS_2_0      1   // Measurement Reference Clock (MRC) Select;
#define CACR2_RCDS_1_0      4   // MRC Freq Div Ratio Select; 0b00: ×1/32, 0b01: ×1/128, 0b10: ×1/1024, 0b11: ×1/8192
#define CACR2_DFS_1_0       6   // Digital Filter Select; 0b00: Disable digital filtering, etc.
#define CAC_CAICR       ((volatile unsigned char *)(CACBASE + 0x4603))  // CAC Interrupt Control Register
#define CAICR_FERRIE        0   // Frequency Error Interrupt Request Enable; 1: Enabled
#define CAICR_MENDIE        1   // Measurement End Interrupt Request Enable; 1: Enabled
#define CAICR_OVFIE         2   // Overflow Interrupt Request Enable; 1: Enabled
#define CAICR_FERRFCL       4   // FERRF Clear; When 1 is written to this bit, the FERRF flag is cleared. This bit is read as 0.
#define CAICR_MENDFCL       5   // MENDF Clear;  ditto
#define CAICR_OVFFCL        6   // OVFF Clear;   ditto
#define CAC_CASTR       ((volatile unsigned char *)(CACBASE + 0x4604))  // CAC Status Register
#define CASTR_FERRF         0   // Frequency Error Flag; 0: Clock frequency is within the allowable range, 1: ... frequency error
#define CASTR_MENDF         1   // Measurement End Flag; 0: Measurement is in progress, 1: Measurement ended
#define CASTR_OVFF          2   // Overflow Flag; 0: The counter has not overflowed, 1: The counter overflowed
#define CAC_CAULVR      ((volatile unsigned short *)(CACBASE + 0x4606))  // CAC Upper-Limit Value Setting Register
#define CAC_CALLVR      ((volatile unsigned short *)(CACBASE + 0x4608))  // CAC Lower-Limit Value Setting Register
#define CAC_CACNTBR     ((volatile unsigned short *)(CACBASE + 0x460A))  // CAC Counter Buffer Register


// ==== Interrupt Control Unit ====

