TriodeGirl/RA4M1_Arduino_UNO-R4_Processor_Direct_Register_Addressing_Defines/susan_ra4m1_minima_register_defines.h
// ==== IRQ Control Register ====
#define IRQCR 0x6000        // IRQ Control Register offset
#define ICU_IRQCR00  ((volatile unsigned char  *)(ICUBASE + IRQCR +  0 ))     // Pin IRQ Control Register 0
#define ICU_IRQCR01  ((volatile unsigned char  *)(ICUBASE + IRQCR +  1 ))     // Pin IRQ Control Register 1
#define ICU_IRQCR02  ((volatile unsigned char  *)(ICUBASE + IRQCR +  2 ))     // Pin IRQ Control Register 2
#define ICU_IRQCR03  ((volatile unsigned char  *)(ICUBASE + IRQCR +  3 ))     // Pin IRQ Control Register 3
#define ICU_IRQCR04  ((volatile unsigned char  *)(ICUBASE + IRQCR +  4 ))     // Pin IRQ Control Register 4
#define ICU_IRQCR05  ((volatile unsigned char  *)(ICUBASE + IRQCR +  5 ))     // Pin IRQ Control Register 5
#define ICU_IRQCR06  ((volatile unsigned char  *)(ICUBASE + IRQCR +  6 ))     // Pin IRQ Control Register 6
#define ICU_IRQCR07  ((volatile unsigned char  *)(ICUBASE + IRQCR +  7 ))     // Pin IRQ Control Register 7
#define ICU_IRQCR08  ((volatile unsigned char  *)(ICUBASE + IRQCR +  8 ))     // Pin IRQ Control Register 8
#define ICU_IRQCR09  ((volatile unsigned char  *)(ICUBASE + IRQCR +  9 ))     // Pin IRQ Control Register 9
#define ICU_IRQCR10  ((volatile unsigned char  *)(ICUBASE + IRQCR + 10 ))     // Pin IRQ Control Register 10
#define ICU_IRQCR11  ((volatile unsigned char  *)(ICUBASE + IRQCR + 11 ))     // Pin IRQ Control Register 11
#define ICU_IRQCR12  ((volatile unsigned char  *)(ICUBASE + IRQCR + 12 ))     // Pin IRQ Control Register 12
#define ICU_IRQCR14  ((volatile unsigned char  *)(ICUBASE + IRQCR + 14 ))     // Pin IRQ Control Register 14
#define ICU_IRQCR15  ((volatile unsigned char  *)(ICUBASE + IRQCR + 15 ))     // Pin IRQ Control Register 15

#define ICU_SELSR0  ((volatile unsigned short  *)(ICUBASE + 0x6200))         // SYS Event Link Setting Register

// ==== NVIC Interrupt Controller ====
#define NVICBASE 0xE0000000 // NVIC Interrupt Controller

// asm volatile("dsb"); // <<<< use a DSB instruction to ensure bus-synchronisition for NVIC write operations

#define NVIC_ICTR    ((volatile unsigned int  *)(NVICBASE + 0xE004))              // Interrupt Controller Type Register
// Total number of interrupt lines in groups of 32: [3:0]	INTLINESNUM
// b0000 = 0...32   << RA4M1 returns 0 - Has only 32 Interrupts - See Table 13.3 Interrupt vector table p.237
// b0001 = 33...64
// b0010 = 65...96
// b0011 = 97...128
// b0100 = 129...160
// b0101 = 161...192
// b0110 = 193...224
// b0111 = 225...256


// NVIC IRQ registers - Generic ARM Cortex-M4F; not all are necessiraly present in the RA4M1
// x = 0..7 for each register type, with 32 bits per register, to support up to 240 IRQs
// * Each bit controls one interrupt, identified by its IRQ# (0..239)
// * Register# x = IRQ# DIV 32
// * Bit n in the register = IRQ# MOD 32

#define NVICISER 0xE100     // Interrupt Set-Enable Registers
#define NVIC_ISER0  ((volatile unsigned int  *)(NVICBASE + NVICISER +(0 * 4)))     // Register 0
#define NVIC_ISER1  ((volatile unsigned int  *)(NVICBASE + NVICISER +(1 * 4)))     // Register 1
#define NVIC_ISER2  ((volatile unsigned int  *)(NVICBASE + NVICISER +(2 * 4)))     // Register 2
#define NVIC_ISER3  ((volatile unsigned int  *)(NVICBASE + NVICISER +(3 * 4)))     // Register 3
#define NVIC_ISER4  ((volatile unsigned int  *)(NVICBASE + NVICISER +(4 * 4)))     // Register 4
#define NVIC_ISER5  ((volatile unsigned int  *)(NVICBASE + NVICISER +(5 * 4)))     // Register 5
#define NVIC_ISER6  ((volatile unsigned int  *)(NVICBASE + NVICISER +(6 * 4)))     // Register 6
#define NVIC_ISER7  ((volatile unsigned int  *)(NVICBASE + NVICISER +(7 * 4)))     // Register 7
#define NVICICER 0xE180     // Interrupt Clear-Enable Registers
#define NVIC_ICER0  ((volatile unsigned int  *)(NVICBASE + NVICICER +(0 * 4)))     // Register 0
#define NVIC_ICER1  ((volatile unsigned int  *)(NVICBASE + NVICICER +(1 * 4)))     // Register 1
#define NVIC_ICER2  ((volatile unsigned int  *)(NVICBASE + NVICICER +(2 * 4)))     // Register 2
#define NVIC_ICER3  ((volatile unsigned int  *)(NVICBASE + NVICICER +(3 * 4)))     // Register 3
#define NVIC_ICER4  ((volatile unsigned int  *)(NVICBASE + NVICICER +(4 * 4)))     // Register 4
#define NVIC_ICER5  ((volatile unsigned int  *)(NVICBASE + NVICICER +(5 * 4)))     // Register 5
#define NVIC_ICER6  ((volatile unsigned int  *)(NVICBASE + NVICICER +(6 * 4)))     // Register 6
#define NVIC_ICER7  ((volatile unsigned int  *)(NVICBASE + NVICICER +(7 * 4)))     // Register 7

#define NVICISPR 0xE200     // Interrupt Set-Pending Registers
#define NVIC_ISPR0  ((volatile unsigned int  *)(NVICBASE + NVICISPR +(0 * 4)))     // Register 0
#define NVIC_ISPR1  ((volatile unsigned int  *)(NVICBASE + NVICISPR +(1 * 4)))     // Register 1
#define NVIC_ISPR2  ((volatile unsigned int  *)(NVICBASE + NVICISPR +(2 * 4)))     // Register 2
#define NVIC_ISPR3  ((volatile unsigned int  *)(NVICBASE + NVICISPR +(3 * 4)))     // Register 3
#define NVIC_ISPR4  ((volatile unsigned int  *)(NVICBASE + NVICISPR +(4 * 4)))     // Register 4
#define NVIC_ISPR5  ((volatile unsigned int  *)(NVICBASE + NVICISPR +(5 * 4)))     // Register 5
#define NVIC_ISPR6  ((volatile unsigned int  *)(NVICBASE + NVICISPR +(6 * 4)))     // Register 6
#define NVIC_ISPR7  ((volatile unsigned int  *)(NVICBASE + NVICISPR +(7 * 4)))     // Register 7
#define NVICICPR 0xE280     // Interrupt Clear-Pending Registers
#define NVIC_ICPR0  ((volatile unsigned int  *)(NVICBASE + NVICICPR +(0 * 4)))     // Register 0
#define NVIC_ICPR1  ((volatile unsigned int  *)(NVICBASE + NVICICPR +(1 * 4)))     // Register 1
#define NVIC_ICPR2  ((volatile unsigned int  *)(NVICBASE + NVICICPR +(2 * 4)))     // Register 2
#define NVIC_ICPR3  ((volatile unsigned int  *)(NVICBASE + NVICICPR +(3 * 4)))     // Register 3
#define NVIC_ICPR4  ((volatile unsigned int  *)(NVICBASE + NVICICPR +(4 * 4)))     // Register 4
#define NVIC_ICPR5  ((volatile unsigned int  *)(NVICBASE + NVICICPR +(5 * 4)))     // Register 5
#define NVIC_ICPR6  ((volatile unsigned int  *)(NVICBASE + NVICICPR +(6 * 4)))     // Register 6
#define NVIC_ICPR7  ((volatile unsigned int  *)(NVICBASE + NVICICPR +(7 * 4)))     // Register 7

#define NVICIABR 0xE300     // Interrupt Active Bit Register - Read Only: Read 1 if interrupt in active state
#define NVIC_IABR0  ((volatile unsigned int  *)(NVICBASE + NVICIABR +(0 * 4)))     // Register 0
#define NVIC_IABR1  ((volatile unsigned int  *)(NVICBASE + NVICIABR +(1 * 4)))     // Register 1
#define NVIC_IABR2  ((volatile unsigned int  *)(NVICBASE + NVICIABR +(2 * 4)))     // Register 2
#define NVIC_IABR3  ((volatile unsigned int  *)(NVICBASE + NVICIABR +(3 * 4)))     // Register 3
#define NVIC_IABR4  ((volatile unsigned int  *)(NVICBASE + NVICIABR +(4 * 4)))     // Register 4
#define NVIC_IABR5  ((volatile unsigned int  *)(NVICBASE + NVICIABR +(5 * 4)))     // Register 5
#define NVIC_IABR6  ((volatile unsigned int  *)(NVICBASE + NVICIABR +(6 * 4)))     // Register 6
#define NVIC_IABR7  ((volatile unsigned int  *)(NVICBASE + NVICIABR +(7 * 4)))     // Register 7

