TriodeGirl/RA4M1_Arduino_UNO-R4_Processor_Direct_Register_Addressing_Defines/susan_ra4m1_minima_register_defines.h
// NVIC_IPRx (x=0..59) – Interrupt Priority Registers
// * Supports up to 240 interrupts: 0..239 (32 in RA4M1)
// *  8-bit priority field for each interrupts (4-bit field for RA4M1)
// *  4 priority values per register (MSB aligned bits of each byte for prioity i.e. 0x10 thru 0xF0)
// *  0 = highest priority, F = lowest priority (USBs are all at 0xC0, mS Timer on AGT is 0xE0)
// *  Register# x = IRQ# DIV 4
// *  Byte offset within the register = IRQ# MOD 4
// *  Ex. IRQ85:
// *  85/4 = 21 with remainder 1 (register 21, byte offset 1): Write priority<<8 to NVIC_IPR2
// *  85/32 = 2 with remainder 21: write 1<<21 to NVIC_SER2


#define NVICIPR  0xE400     // Interrupt Priority Register
#define NVIC_IPR00  ((volatile unsigned int  *)(NVICBASE + NVICIPR +(0 * 4)))     // Register 0: NVIC_IPR0 TO 3
#define NVIC_IPR04  ((volatile unsigned int  *)(NVICBASE + NVICIPR +(1 * 4)))     // Register 1
#define NVIC_IPR08  ((volatile unsigned int  *)(NVICBASE + NVICIPR +(2 * 4)))     // Register 2
#define NVIC_IPR12  ((volatile unsigned int  *)(NVICBASE + NVICIPR +(3 * 4)))     // Register 3
#define NVIC_IPR16  ((volatile unsigned int  *)(NVICBASE + NVICIPR +(4 * 4)))     // Register 4
#define NVIC_IPR20  ((volatile unsigned int  *)(NVICBASE + NVICIPR +(5 * 4)))     // Register 5
#define NVIC_IPR24  ((volatile unsigned int  *)(NVICBASE + NVICIPR +(6 * 4)))     // Register 6
#define NVIC_IPR28  ((volatile unsigned int  *)(NVICBASE + NVICIPR +(7 * 4)))     // Register 7

// Also byte accessible:
#define NVIC_IPR00_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  0 ))     // For direct byte access
#define NVIC_IPR01_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  1 ))     // For direct byte access
#define NVIC_IPR02_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  2 ))     // For direct byte access
#define NVIC_IPR03_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  3 ))     // For direct byte access
#define NVIC_IPR04_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  4 ))     // For direct byte access
#define NVIC_IPR05_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  5 ))     // For direct byte access
#define NVIC_IPR06_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  6 ))     // For direct byte access
#define NVIC_IPR07_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  7 ))     // For direct byte access
#define NVIC_IPR08_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  8 ))     // For direct byte access
#define NVIC_IPR09_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR +  9 ))     // For direct byte access
#define NVIC_IPR10_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 10 ))     // For direct byte access
#define NVIC_IPR11_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 11 ))     // For direct byte access
#define NVIC_IPR12_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 12 ))     // For direct byte access
#define NVIC_IPR13_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 13 ))     // For direct byte access
#define NVIC_IPR14_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 14 ))     // For direct byte access
#define NVIC_IPR15_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 15 ))     // For direct byte access
#define NVIC_IPR16_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 16 ))     // For direct byte access
#define NVIC_IPR17_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 17 ))     // For direct byte access
#define NVIC_IPR18_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 18 ))     // For direct byte access
#define NVIC_IPR19_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 19 ))     // For direct byte access
#define NVIC_IPR20_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 20 ))     // For direct byte access
#define NVIC_IPR21_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 21 ))     // For direct byte access
#define NVIC_IPR22_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 22 ))     // For direct byte access
#define NVIC_IPR23_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 23 ))     // For direct byte access
#define NVIC_IPR24_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 24 ))     // For direct byte access
#define NVIC_IPR25_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 25 ))     // For direct byte access
#define NVIC_IPR26_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 26 ))     // For direct byte access
#define NVIC_IPR27_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 27 ))     // For direct byte access
#define NVIC_IPR28_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 28 ))     // For direct byte access
#define NVIC_IPR29_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 29 ))     // For direct byte access
#define NVIC_IPR30_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 30 ))     // For direct byte access
#define NVIC_IPR31_BY  ((volatile unsigned char  *)(NVICBASE + NVICIPR + 31 ))     // For direct byte access



// ==== Event Link Controller ====
#define ELCBASE 0x40040000 // Event Link Controller
#define ELC_ELCR     ((volatile unsigned char  *)(ELCBASE + 0x1000))              // Event Link Controller Register
#define ELC_ELSEGR0  ((volatile unsigned char  *)(ELCBASE + 0x1002))              // Event Link Software Event Generation Register 0
#define ELC_ELSEGR1  ((volatile unsigned char  *)(ELCBASE + 0x1004))              // Event Link Software Event Generation Register 1
#define ELSR 0x1010        // Event Link Setting Registers
#define ELC_ELSR00   ((volatile unsigned short *)(ELCBASE + ELSR +( 0 * 4)))      // ELC_GPTA
#define ELC_ELSR01   ((volatile unsigned short *)(ELCBASE + ELSR +( 1 * 4)))      // ELC_GPTB
#define ELC_ELSR02   ((volatile unsigned short *)(ELCBASE + ELSR +( 2 * 4)))      // ELC_GPTC
#define ELC_ELSR03   ((volatile unsigned short *)(ELCBASE + ELSR +( 3 * 4)))      // ELC_GPTD
#define ELC_ELSR04   ((volatile unsigned short *)(ELCBASE + ELSR +( 4 * 4)))      // ELC_GPTE
#define ELC_ELSR05   ((volatile unsigned short *)(ELCBASE + ELSR +( 5 * 4)))      // ELC_GPTF
#define ELC_ELSR06   ((volatile unsigned short *)(ELCBASE + ELSR +( 6 * 4)))      // ELC_GPTG
#define ELC_ELSR07   ((volatile unsigned short *)(ELCBASE + ELSR +( 7 * 4)))      // ELC_GPTH
#define ELC_ELSR08   ((volatile unsigned short *)(ELCBASE + ELSR +( 8 * 4)))      // ELC_AD00 - ADC14A
#define ELC_ELSR09   ((volatile unsigned short *)(ELCBASE + ELSR +( 9 * 4)))      // ELC_AD01 - ADC14B
#define ELC_ELSR12   ((volatile unsigned short *)(ELCBASE + ELSR +(12 * 4)))      // ELC_DA0 - DAC12
#define ELC_ELSR14   ((volatile unsigned short *)(ELCBASE + ELSR +(14 * 4)))      // ELC_PORT1
#define ELC_ELSR15   ((volatile unsigned short *)(ELCBASE + ELSR +(15 * 4)))      // ELC_PORT2
#define ELC_ELSR16   ((volatile unsigned short *)(ELCBASE + ELSR +(16 * 4)))      // ELC_PORT3
#define ELC_ELSR17   ((volatile unsigned short *)(ELCBASE + ELSR +(17 * 4)))      // ELC_PORT4
#define ELC_ELSR18   ((volatile unsigned short *)(ELCBASE + ELSR +(18 * 4)))      // ELC_CTSU


// ==== Low Power Mode Control ====
#define SYSTEM 0x40010000 // System Registers
#define SYSTEM_SBYCR   ((volatile unsigned short *)(SYSTEM + 0xE00C))      // Standby Control Register
#define SYSTEM_MSTPCRA ((volatile unsigned int   *)(SYSTEM + 0xE01C))      // Module Stop Control Register A

