TriodeGirl/RA4M1_Arduino_UNO-R4_Processor_Direct_Register_Addressing_Defines/susan_ra4m1_minima_register_defines.h
#define MSTP 0x40040000 // Module Registers
#define MSTP_MSTPCRB   ((volatile unsigned int   *)(MSTP + 0x7000))      // Module Stop Control Register B
#define MSTPB2   2 // CAN0
#define MSTPB8   8 // IIC1
#define MSTPB9   9 // IIC0
#define MSTPB11 11 // USBFS
#define MSTPB18 18 // SPI1
#define MSTPB19 19 // SPI0
#define MSTPB22 22 // SCI9
#define MSTPB29 29 // SCI2
#define MSTPB30 30 // SCI1
#define MSTPB31 31 // SCI0

#define MSTP_MSTPCRC   ((volatile unsigned int   *)(MSTP + 0x7004))      // Module Stop Control Register C
#define MSTPC0   0 // CAC   - Clock Frequency Accuracy Measurement Circuit Module
#define MSTPC1   1 // CRC   - Cyclic Redundancy Check Calculator Module
#define MSTPC3   3 // CTSU  - Capacitive Touch Sensing Unit Module
#define MSTPC4   4 // SLCDC - Segment LCD Controller Module
#define MSTPC8   8 // SSIE0 - Serial Sound Interface Enhanced Module
#define MSTPC13 13 // DOC   - Data Operation Circuit Module
#define MSTPC14 14 // ELC   - Event Link Controller Module
#define MSTPC31 31 // SCE5  - SCE5 Module

#define MSTP_MSTPCRD   ((volatile unsigned int   *)(MSTP + 0x7008))      // Module Stop Control Register D
#define MSTPD2   2 // AGT1   - Asynchronous General Purpose Timer 1 Module
#define MSTPD3   3 // AGT0   - Asynchronous General Purpose Timer 0 Module
#define MSTPD5   5 // GPT32x - GPT320 and GPT321 General 32 bit PWM Timer Module
#define MSTPD6   6 // GPT12x - GPT162 thr GPT167 General 16 bit PWM Timer Module
#define MSTPD14 14 // POEG   - Port Output Enable for GPT Module Stop
#define MSTPD16 16 // ADC140 - 14-Bit A/D Converter Module
#define MSTPD19 19 // DAC8   -  8-Bit D/A Converter Module
#define MSTPD20 20 // DAC12  - 12-Bit D/A Converter Module
#define MSTPD29 29 // ACMPLP - Low-Power Analog Comparator Module
#define MSTPD31 31 // OPAMP  - Operational Amplifier Module

// These bits are read as 1, the write value should be 1.
// Bit value 0: Cancel the module-stop state
// Bit value 1: Enter the module-stop state.


// ==== USB 2.0 Full-Speed Module ====
#define USBFSBASE  0x40090000

#define USBFS_SYSCFG     ((volatile unsigned short *)(USBFSBASE + 0x0000))
#define USBFS_SYSSTS0    ((volatile unsigned short *)(USBFSBASE + 0x0004))
#define USBFS_DVSTCTR0   ((volatile unsigned short *)(USBFSBASE + 0x0008))
#define USBFS_CFIFO      ((volatile unsigned short *)(USBFSBASE + 0x0014))
#define USBFS_D0FIFO     ((volatile unsigned short *)(USBFSBASE + 0x0018))
#define USBFS_D1FIFO     ((volatile unsigned short *)(USBFSBASE + 0x001C))
#define USBFS_CFIFOL     ((volatile unsigned char  *)(USBFSBASE + 0x0014))
#define USBFS_D0FIFOL    ((volatile unsigned char  *)(USBFSBASE + 0x0018))
#define USBFS_D1FIFOL    ((volatile unsigned char  *)(USBFSBASE + 0x001C))
#define USBFS_CFIFOSEL   ((volatile unsigned short *)(USBFSBASE + 0x0020))
#define USBFS_D0FIFOSEL  ((volatile unsigned short *)(USBFSBASE + 0x0028))
#define USBFS_D1FIFOSEL  ((volatile unsigned short *)(USBFSBASE + 0x002C))
#define USBFS_CFIFOCTR   ((volatile unsigned short *)(USBFSBASE + 0x0022))
#define USBFS_D0FIFOCTR  ((volatile unsigned short *)(USBFSBASE + 0x002A))
#define USBFS_D1FIFOCTR  ((volatile unsigned short *)(USBFSBASE + 0x002E))
#define USBFS_INTENB0    ((volatile unsigned short *)(USBFSBASE + 0x0030))
#define USBFS_INTENB1    ((volatile unsigned short *)(USBFSBASE + 0x0032))
#define USBFS_BRDYENB    ((volatile unsigned short *)(USBFSBASE + 0x0036))
#define USBFS_NRDYENB    ((volatile unsigned short *)(USBFSBASE + 0x0038))
#define USBFS_BEMPENB    ((volatile unsigned short *)(USBFSBASE + 0x003A))
#define USBFS_SOFCFG     ((volatile unsigned short *)(USBFSBASE + 0x003C))
#define USBFS_INTSTS0    ((volatile unsigned short *)(USBFSBASE + 0x0040))
#define USBFS_INTSTS1    ((volatile unsigned short *)(USBFSBASE + 0x0042))
#define USBFS_BRDYSTS    ((volatile unsigned short *)(USBFSBASE + 0x0046))
#define USBFS_NRDYSTS    ((volatile unsigned short *)(USBFSBASE + 0x0048))
#define USBFS_BEMPSTS    ((volatile unsigned short *)(USBFSBASE + 0x004A))
#define USBFS_FRMNUM     ((volatile unsigned short *)(USBFSBASE + 0x004C))
#define USBFS_USBREQ     ((volatile unsigned short *)(USBFSBASE + 0x0054))
#define USBFS_USBVAL     ((volatile unsigned short *)(USBFSBASE + 0x0056))
#define USBFS_USBINDX    ((volatile unsigned short *)(USBFSBASE + 0x0058))
#define USBFS_USBLENG    ((volatile unsigned short *)(USBFSBASE + 0x005A))
#define USBFS_DCPCFG     ((volatile unsigned short *)(USBFSBASE + 0x005C))
#define USBFS_DCPMAXP    ((volatile unsigned short *)(USBFSBASE + 0x005E))
#define USBFS_DCPCTR     ((volatile unsigned short *)(USBFSBASE + 0x0060))
#define USBFS_PIPESEL    ((volatile unsigned short *)(USBFSBASE + 0x0064))
#define USBFS_PIPECFG    ((volatile unsigned short *)(USBFSBASE + 0x0068))
#define USBFS_PIPEMAXP   ((volatile unsigned short *)(USBFSBASE + 0x006C))
#define USBFS_PIPEPERI   ((volatile unsigned short *)(USBFSBASE + 0x006E))
#define USBFS_PIPE1CTR   ((volatile unsigned short *)(USBFSBASE + 0x0070))
#define USBFS_PIPE2CTR   ((volatile unsigned short *)(USBFSBASE + 0x0072))
#define USBFS_PIPE3CTR   ((volatile unsigned short *)(USBFSBASE + 0x0074))
#define USBFS_PIPE4CTR   ((volatile unsigned short *)(USBFSBASE + 0x0076))
#define USBFS_PIPE5CTR   ((volatile unsigned short *)(USBFSBASE + 0x0078))
#define USBFS_PIPE6CTR   ((volatile unsigned short *)(USBFSBASE + 0x007A))
#define USBFS_PIPE7CTR   ((volatile unsigned short *)(USBFSBASE + 0x007C))
#define USBFS_PIPE8CTR   ((volatile unsigned short *)(USBFSBASE + 0x007E))
#define USBFS_PIPE9CTR   ((volatile unsigned short *)(USBFSBASE + 0x0080))
#define USBFS_PIPE1TRE   ((volatile unsigned short *)(USBFSBASE + 0x0090))
#define USBFS_PIPE2TRE   ((volatile unsigned short *)(USBFSBASE + 0x0094))
#define USBFS_PIPE3TRE   ((volatile unsigned short *)(USBFSBASE + 0x0098))
#define USBFS_PIPE4TRE   ((volatile unsigned short *)(USBFSBASE + 0x009C))
#define USBFS_PIPE5TRE   ((volatile unsigned short *)(USBFSBASE + 0x00A0))
#define USBFS_PIPE1TRN   ((volatile unsigned short *)(USBFSBASE + 0x0092))
#define USBFS_PIPE2TRN   ((volatile unsigned short *)(USBFSBASE + 0x0096))
#define USBFS_PIPE3TRN   ((volatile unsigned short *)(USBFSBASE + 0x009A))
#define USBFS_PIPE4TRN   ((volatile unsigned short *)(USBFSBASE + 0x009E))
#define USBFS_PIPE5TRN   ((volatile unsigned short *)(USBFSBASE + 0x00A2))
#define USBFS_DEVADD0    ((volatile unsigned short *)(USBFSBASE + 0x00D0))
#define USBFS_DEVADD1    ((volatile unsigned short *)(USBFSBASE + 0x00D2))
#define USBFS_DEVADD2    ((volatile unsigned short *)(USBFSBASE + 0x00D4))
#define USBFS_DEVADD3    ((volatile unsigned short *)(USBFSBASE + 0x00D6))
#define USBFS_DEVADD4    ((volatile unsigned short *)(USBFSBASE + 0x00D8))
#define USBFS_DEVADD5    ((volatile unsigned short *)(USBFSBASE + 0x00DA))
#define USBFS_USBMC      ((volatile unsigned short *)(USBFSBASE + 0x00CC))
#define USBFS_USBBCCTRL0 ((volatile unsigned short *)(USBFSBASE + 0x00B0))


