TriodeGirl/RA4M1_Arduino_UNO-R4_Processor_Direct_Register_Addressing_Defines/susan_ra4m1_minima_register_defines.h
// ==== 14-Bit A/D Converter ====
#define ADCBASE 0x40050000 /* ADC Base */
                                                                           // N/C = Pin not connected; N/A = No pin for LQFP64 package
// 16 bit registers
#define ADC140_ADDR00   ((volatile unsigned short *)(ADCBASE + 0xC020))      // A1 (P000 AN00 AMP+)
#define ADC140_ADDR01   ((volatile unsigned short *)(ADCBASE + 0xC020 +  2)) // A2 (P001 AN01 AMP-)
#define ADC140_ADDR02   ((volatile unsigned short *)(ADCBASE + 0xC020 +  4)) // A3 (P002 AN02 AMPO)
#define ADC140_ADDR03   ((volatile unsigned short *)(ADCBASE + 0xC020 +  6)) // N/C
#define ADC140_ADDR04   ((volatile unsigned short *)(ADCBASE + 0xC020 +  8)) // N/C
#define ADC140_ADDR05   ((volatile unsigned short *)(ADCBASE + 0xC020 + 10)) // Aref (P010 AN05 VrefH0)
#define ADC140_ADDR06   ((volatile unsigned short *)(ADCBASE + 0xC020 + 12)) // N/C
#define ADC140_ADDR07   ((volatile unsigned short *)(ADCBASE + 0xC020 + 14)) // TxLED (P012 AN07)
#define ADC140_ADDR08   ((volatile unsigned short *)(ADCBASE + 0xC020 + 16)) // RxLED (P013 AN08)
#define ADC140_ADDR09   ((volatile unsigned short *)(ADCBASE + 0xC020 + 18)) // A0 (P014 AN09 DAC)
#define ADC140_ADDR10   ((volatile unsigned short *)(ADCBASE + 0xC020 + 20)) // N/C
#define ADC140_ADDR11   ((volatile unsigned short *)(ADCBASE + 0xC020 + 22)) // N/A
#define ADC140_ADDR12   ((volatile unsigned short *)(ADCBASE + 0xC020 + 24)) // N/A
#define ADC140_ADDR13   ((volatile unsigned short *)(ADCBASE + 0xC020 + 26)) // N/A
#define ADC140_ADDR14   ((volatile unsigned short *)(ADCBASE + 0xC020 + 28)) // N/A
#define ADC140_ADDR16   ((volatile unsigned short *)(ADCBASE + 0xC040))      // R10/R26 net (P500 AN16)
#define ADC140_ADDR17   ((volatile unsigned short *)(ADCBASE + 0xC040 +  2)) // SWD-pin8 SCI1_TxD (P501 AN17)
#define ADC140_ADDR18   ((volatile unsigned short *)(ADCBASE + 0xC040 +  4)) // SWD-pin7 SCI1_RxD (P502 AN18)
#define ADC140_ADDR19   ((volatile unsigned short *)(ADCBASE + 0xC040 +  6)) // D4 (P103 AN19)
#define ADC140_ADDR20   ((volatile unsigned short *)(ADCBASE + 0xC040 +  8)) // D5 (P102 AN20 ADtrg0)
#define ADC140_ADDR21   ((volatile unsigned short *)(ADCBASE + 0xC040 + 10)) // A4 (P101 AN21 SDA)
#define ADC140_ADDR22   ((volatile unsigned short *)(ADCBASE + 0xC040 + 12)) // A5 (P100 AN20 SCL)
#define ADC140_ADDR23   ((volatile unsigned short *)(ADCBASE + 0xC040 + 14)) // N/A
#define ADC140_ADDR24   ((volatile unsigned short *)(ADCBASE + 0xC040 + 16)) // N/A
#define ADC140_ADDR25   ((volatile unsigned short *)(ADCBASE + 0xC040 + 18)) // N/A
#define ADC140_ADDBLDR  ((volatile unsigned short *)(ADCBASE + 0xC018))    // A/D Data Duplexing Register
#define ADC140_ADTSDR   ((volatile unsigned short *)(ADCBASE + 0xC01A))    // A/D conversion result of temperature sensor output
#define ADC140_ADOCDR   ((volatile unsigned short *)(ADCBASE + 0xC01C))    // A/D result of internal reference voltage
#define ADC140_ADDBLDRA ((volatile unsigned short *)(ADCBASE + 0xC084))    // A/D Data Duplexing Register A
#define ADC140_ADDBLDRB ((volatile unsigned short *)(ADCBASE + 0xC086))    // A/D Data Duplexing Register B
// A/D Control Register
#define ADC140_ADCSR      ((volatile unsigned short *)(ADCBASE + 0xC000))
#define ADCSR_DBLANS_4_0   0 // Double Trigger Channel Select
#define ADCSR_GBADIE       6 // Group B Scan End Interrupt Enable
#define ADCSR_DBLE         7 // Double Trigger Mode Select
#define ADCSR_EXTRG        8 // Trigger Select
#define ADCSR_TRGE         9 // Trigger Start Enable
#define ADCSR_ADHSC       10 // A/D Conversion Mode Select - 0: High-speed; 1: Low-power
#define ADCSR_ADCS_1_0    13 // Scan Mode Select
#define ADCSR_ADST        15 // A/D Conversion Start
// A/D Channel Select Register A0
#define ADC140_ADANSA0    ((volatile unsigned short *)(ADCBASE + 0xC004))
#define ADANSA0_ANSA00     0 // A/D Conversion Channel Select - 1: Associated input channel selected
#define ADANSA0_ANSA01     1
#define ADANSA0_ANSA02     2
#define ADANSA0_ANSA03     3
#define ADANSA0_ANSA04     4
#define ADANSA0_ANSA05     5
#define ADANSA0_ANSA06     6
#define ADANSA0_ANSA07     7
#define ADANSA0_ANSA08     8
#define ADANSA0_ANSA09     9
#define ADANSA0_ANSA10    10
#define ADANSA0_ANSA11    11
#define ADANSA0_ANSA12    12
#define ADANSA0_ANSA13    13
#define ADANSA0_ANSA14    14
// A/D Channel Select Register A1
#define ADC140_ADANSA1    ((volatile unsigned short *)(ADCBASE + 0xC006))
#define ADANSA1_ANSA16     0 // A/D Conversion Channel Select - 1: Associated input channel selected
#define ADANSA1_ANSA17     1
#define ADANSA1_ANSA18     2
#define ADANSA1_ANSA19     3
#define ADANSA1_ANSA20     4
#define ADANSA1_ANSA21     5
#define ADANSA1_ANSA22     6
#define ADANSA1_ANSA23     7
#define ADANSA1_ANSA24     8
#define ADANSA1_ANSA25     9
// A/D-Converted Value Addition/Average Channel Select Register 0
#define ADC140_ADADS0     ((volatile unsigned short *)(ADCBASE + 0xC008))
#define ADADS0_ADS00       0 // A/D Conversion Channel Select - 1: Associated input channel selected
#define ADADS0_ADS01       1
#define ADADS0_ADS02       2
#define ADADS0_ADS03       3
#define ADADS0_ADS04       4
#define ADADS0_ADS05       5
#define ADADS0_ADS06       6
#define ADADS0_ADS07       7
#define ADADS0_ADS08       8
#define ADADS0_ADS09       9
#define ADADS0_ADS10      10
#define ADADS0_ADS11      11
#define ADADS0_ADS12      12
#define ADADS0_ADS13      13
#define ADADS0_ADS14      14
// A/D-Converted Value Addition/Average Channel Select Register 1
#define ADC140_ADADS1     ((volatile unsigned short *)(ADCBASE + 0xC00A))
#define ADADS1_ADS16       0 // A/D Conversion Channel Select - 1: Associated input channel selected
#define ADADS1_ADS17       1
#define ADADS1_ADS18       2
#define ADADS1_ADS19       3
#define ADADS1_ADS20       4
#define ADADS1_ADS21       5
#define ADADS1_ADS22       6
#define ADADS1_ADS23       7
#define ADADS1_ADS24       8
#define ADADS1_ADS25       9
// A/D Control Extended Register
#define ADC140_ADCER      ((volatile unsigned short *)(ADCBASE + 0xC00E))
#define ADCER_ADPCR_1_0    1 // A/D Conversion Accuracy Specify - 0b00: 12-bit accuracy; 0b11: 14-bit accuracy
#define ADCER_ACE          5 // A/D Data Register Automatic Clearing Enable
#define ADCER_DIAGVAL_1_0  8 // Self-Diagnosis Conversion Voltage Select
#define ADCER_DIAGLD      10 // Self-Diagnosis Mode Select
#define ADCER_DIAGM       11 // Self-Diagnosis Enable
#define ADCER_ADRFMT      15 // A/D Data Register Format Select - 0: Flush-right; 1: Flush-left
// A/D Conversion Start Trigger Select Register
#define ADC140_ADSTRGR    ((volatile unsigned short *)(ADCBASE + 0xC010))
#define ADSTRGR_TRSB_5_0   0 // A/D Conversion Start Trigger Select for Group B
#define ADSTRGR_TRSA_5_0   8 // A/D Conversion Start Trigger Select for Group A OR single scan mode
// A/D Conversion Extended Input Control Register
#define ADC140_ADEXICR    ((volatile unsigned short *)(ADCBASE + 0xC012))
#define ADEXICR_TSSAD      0 // Temperature Sensor Output A/DConverted Value Addition/Average Mode Select
#define ADEXICR_OCSAD      1 // Internal Reference Voltage A/DConverted Value Addition/Average Mode Select
#define ADEXICR_TSSA       8 // Temperature Sensor Output A/D Conversion Select
#define ADEXICR_OCSA       9 // Internal Reference Voltage A/D Conversion Select
// A/D Channel Select Register B0
#define ADC140_ADANSB0    ((volatile unsigned short *)(ADCBASE + 0xC014))
#define ADANSB0_ANSB00     0 // A/D Conversion Channel Select - 1: Associated input channel selected
#define ADANSB0_ANSB01     1
#define ADANSB0_ANSB02     2
#define ADANSB0_ANSB03     3
#define ADANSB0_ANSB04     4
#define ADANSB0_ANSA05     5
#define ADANSB0_ANSA06     6
#define ADANSB0_ANSA07     7
#define ADANSB0_ANSA08     8
#define ADANSB0_ANSA09     9
#define ADANSB0_ANSA10    10
#define ADANSB0_ANSA11    11
#define ADANSB0_ANSA12    12
#define ADANSB0_ANSA13    13
#define ADANSB0_ANSA14    14
// A/D Channel Select Register B1
#define ADC140_ADANSB1    ((volatile unsigned short *)(ADCBASE + 0xC016))
#define ADANSB1_ANSA16     0 // A/D Conversion Channel Select - 1: Associated input channel selected
#define ADANSB1_ANSA17     1
#define ADANSB1_ANSA18     2
#define ADANSB1_ANSA19     3
#define ADANSB1_ANSA20     4
#define ADANSB1_ANSA21     5
#define ADANSB1_ANSA22     6
#define ADANSB1_ANSA23     7
#define ADANSB1_ANSA24     8
#define ADANSB1_ANSA25     9
// A/D Self-Diagnosis Data Register
#define ADC140_ADRD       ((volatile unsigned short *)(ADCBASE + 0xC01E))
// A/D Group Scan Priority Control Register
#define ADC140_ADGSPCR    ((volatile unsigned short *)(ADCBASE + 0xC080))
#define ADGSPCR_PGS        0 // Group A Priority Control Setting
#define ADGSPCR_GBRSCN     1 // Group B Restart Setting
#define ADGSPCR_GBRP      15 // Group B Single Scan Continuous Start
// A/D Compare Function Control Register
#define ADC140_ADCMPCR    ((volatile unsigned short *)(ADCBASE + 0xC090))
#define ADCMPCR_CMPAB_1_0  0 // Window A/B Composite Conditions Setting
#define ADCMPCR_CMPBE      9 // Compare Window B Operation Enable
#define ADCMPCR_CMPAE     11 // Compare Window A Operation Enable
#define ADCMPCR_CMPBIE    13 // Compare B Interrupt Enable
#define ADCMPCR_WCMPE     14 // Window Function Setting
#define ADCMPCR_CMPAIE    15 // Compare A Interrupt Enable
// A/D Compare Function Window Registers
#define ADC140_ADCMPANSR0 ((volatile unsigned short *)(ADCBASE + 0xC094)) // A/D Compare Function Window A Channel Select Register 0
#define ADC140_ADCMPANSR1 ((volatile unsigned short *)(ADCBASE + 0xC096)) // A/D Compare Function Window A Channel Select Register 1
#define ADC140_ADCMPLR0   ((volatile unsigned short *)(ADCBASE + 0xC098)) // A/D Compare Function Window A Comparison Condition Setting Register 0
#define ADC140_ADCMPLR1   ((volatile unsigned short *)(ADCBASE + 0xC09A)) // A/D Compare Function Window A Comparison Condition Setting Register 1
#define ADC140_ADCMPDR0   ((volatile unsigned short *)(ADCBASE + 0xC09C)) // A/D Compare Function Window A Lower-Side Level Setting Register
#define ADC140_ADCMPDR1   ((volatile unsigned short *)(ADCBASE + 0xC09E)) // A/D Compare Function Window A Upper-Side Level Setting Register
#define ADC140_ADWINLLB   ((volatile unsigned short *)(ADCBASE + 0xC0A8)) // A/D Compare Function Window B Lower-Side Level Setting Register
#define ADC140_ADWINULB   ((volatile unsigned short *)(ADCBASE + 0xC0AA)) // A/D Compare Function Window B Upper-Side Level Setting Register
#define ADC140_ADCMPSR0   ((volatile unsigned short *)(ADCBASE + 0xC0A0)) // A/D Compare Function Window A Channel Status Register 0
#define ADC140_ADCMPSR1   ((volatile unsigned short *)(ADCBASE + 0xC0A2)) // A/D Compare Function Window A Channel Status Register 1

