TriodeGirl/RA4M1_Arduino_UNO-R4_Processor_Direct_Register_Addressing_Defines/susan_ra4m1_minima_register_defines.h
//#define GTCCRE 0x8058 // General PWM Timer Compare Capture Register E  - As above...
#define GTCCRE 0x805C // General PWM Timer Compare Capture Register E
#define GPT320_GTCCRE ((volatile unsigned int *)(GPTBASE + GTCCRE))
#define GPT321_GTCCRE ((volatile unsigned int *)(GPTBASE + GTCCRE + 0x0100))
#define GPT162_GTCCRE ((volatile unsigned int *)(GPTBASE + GTCCRE + 0x0200))
#define GPT163_GTCCRE ((volatile unsigned int *)(GPTBASE + GTCCRE + 0x0300))
#define GPT164_GTCCRE ((volatile unsigned int *)(GPTBASE + GTCCRE + 0x0400))
#define GPT165_GTCCRE ((volatile unsigned int *)(GPTBASE + GTCCRE + 0x0500))
#define GPT166_GTCCRE ((volatile unsigned int *)(GPTBASE + GTCCRE + 0x0600))
#define GPT167_GTCCRE ((volatile unsigned int *)(GPTBASE + GTCCRE + 0x0700))

#define GTCCRF 0x8060 // General PWM Timer Compare Capture Register F
#define GPT320_GTCCRF ((volatile unsigned int *)(GPTBASE + GTCCRF))
#define GPT321_GTCCRF ((volatile unsigned int *)(GPTBASE + GTCCRF + 0x0100))
#define GPT162_GTCCRF ((volatile unsigned int *)(GPTBASE + GTCCRF + 0x0200))
#define GPT163_GTCCRF ((volatile unsigned int *)(GPTBASE + GTCCRF + 0x0300))
#define GPT164_GTCCRF ((volatile unsigned int *)(GPTBASE + GTCCRF + 0x0400))
#define GPT165_GTCCRF ((volatile unsigned int *)(GPTBASE + GTCCRF + 0x0500))
#define GPT166_GTCCRF ((volatile unsigned int *)(GPTBASE + GTCCRF + 0x0600))
#define GPT167_GTCCRF ((volatile unsigned int *)(GPTBASE + GTCCRF + 0x0700))

#define GTPR 0x8064 // General PWM Timer Cycle Setting Register
#define GPT320_GTPR ((volatile unsigned int *)(GPTBASE + GTPR))
#define GPT321_GTPR ((volatile unsigned int *)(GPTBASE + GTPR + 0x0100))
#define GPT162_GTPR ((volatile unsigned int *)(GPTBASE + GTPR + 0x0200))
#define GPT163_GTPR ((volatile unsigned int *)(GPTBASE + GTPR + 0x0300))
#define GPT164_GTPR ((volatile unsigned int *)(GPTBASE + GTPR + 0x0400))
#define GPT165_GTPR ((volatile unsigned int *)(GPTBASE + GTPR + 0x0500))
#define GPT166_GTPR ((volatile unsigned int *)(GPTBASE + GTPR + 0x0600))
#define GPT167_GTPR ((volatile unsigned int *)(GPTBASE + GTPR + 0x0700))

#define GTPBR 0x8068 // General PWM Timer Cycle Setting Buffer Register
#define GPT320_GTPBR ((volatile unsigned int *)(GPTBASE + GTPBR))
#define GPT321_GTPBR ((volatile unsigned int *)(GPTBASE + GTPBR + 0x0100))
#define GPT162_GTPBR ((volatile unsigned int *)(GPTBASE + GTPBR + 0x0200))
#define GPT163_GTPBR ((volatile unsigned int *)(GPTBASE + GTPBR + 0x0300))
#define GPT164_GTPBR ((volatile unsigned int *)(GPTBASE + GTPBR + 0x0400))
#define GPT165_GTPBR ((volatile unsigned int *)(GPTBASE + GTPBR + 0x0500))
#define GPT166_GTPBR ((volatile unsigned int *)(GPTBASE + GTPBR + 0x0600))
#define GPT167_GTPBR ((volatile unsigned int *)(GPTBASE + GTPBR + 0x0700))

// ====  Asynchronous General Purpose Timer (AGT) =====
#define AGTBASE 0x40084000
#define AGT0_AGT    ((volatile unsigned short *)(AGTBASE))         // AGT Counter Register
#define AGT1_AGT    ((volatile unsigned short *)(AGTBASE + 0x100))
#define AGT0_AGTCMA ((volatile unsigned short *)(AGTBASE + 0x002)) // AGT Compare Match A Register
#define AGT1_AGTCMA ((volatile unsigned short *)(AGTBASE + 0x102))
#define AGT0_AGTCMB ((volatile unsigned short *)(AGTBASE + 0x004)) // AGT Compare Match B Register
#define AGT1_AGTCMB ((volatile unsigned short *)(AGTBASE + 0x104))

// 8 bit registers
#define AGT0_AGTCR    ((volatile unsigned char  *)(AGTBASE + 0x008))  // AGT Control Register
#define AGT1_AGTCR    ((volatile unsigned char  *)(AGTBASE + 0x108))  //
#define AGTCR_TSTART 0  // R/W - AGT Count Start; 1: Count starts, 0: Count stops
#define AGTCR_TCSTF  1  // R   - AGT Count Status Flag; 1: Count in progress, 0: Count is stopped
#define AGTCR_TSTOP  2  // W   - AGT Count Forced Stop; 1: The count is forcibly stopped, 0: Writing 0 is invalid!!!
#define AGT0_AGTMR1   ((volatile unsigned char  *)(AGTBASE + 0x009))  // AGT Mode Register 1
#define AGT1_AGTMR1   ((volatile unsigned char  *)(AGTBASE + 0x109))  //
#define AGT0_AGTMR2   ((volatile unsigned char  *)(AGTBASE + 0x00A))  // AGT Mode Register 2
#define AGT1_AGTMR2   ((volatile unsigned char  *)(AGTBASE + 0x10A))  //
#define AGT0_AGTIOC   ((volatile unsigned char  *)(AGTBASE + 0x00C))  // AGT I/O Control Register
#define AGT1_AGTIOC   ((volatile unsigned char  *)(AGTBASE + 0x10C))  //
#define AGTIOC_TOE   2  // AGTOn Output Enable
#define AGT0_AGTISR   ((volatile unsigned char  *)(AGTBASE + 0x00D))  // AGT Event Pin Select Register
#define AGT1_AGTISR   ((volatile unsigned char  *)(AGTBASE + 0x10D))  //
#define AGT0_AGTCMSR  ((volatile unsigned char  *)(AGTBASE + 0x00E))  // AGT Compare Match Function Select Register
#define AGT1_AGTCMSR  ((volatile unsigned char  *)(AGTBASE + 0x10E))  //
#define AGT0_AGTIOSEL ((volatile unsigned char  *)(AGTBASE + 0x00F))  // AGT Pin Select Register
#define AGT1_AGTIOSEL ((volatile unsigned char  *)(AGTBASE + 0x10F))  //

// Note: With the Arduino IDE setup, it does not appear possible to use the WatchDog timers
// ====  Watchdog Timer (WDT) =====
#define WDTBASE 0x40044200
#define WDT_WDTCR    ((volatile unsigned short *)(WDTBASE + 0x02))  // WDT Control Register
#define WDT_WDTSR    ((volatile unsigned short *)(WDTBASE + 0x04))  // WDT Status Register

// 8 bit registers
#define WDT_WDTRR    ((volatile unsigned char  *)(WDTBASE + 0x00))  // WDT Refresh Register
#define WDT_WDTRCR   ((volatile unsigned char  *)(WDTBASE + 0x06))  // WDT Reset Control Register
#define WDT_WDTCSTPR ((volatile unsigned char  *)(WDTBASE + 0x06))  // WDT Count Stop Control Register

// ====  Independant Watchdog Timer (IWDT) =====
#define IWDTBASE 0x40044000
#define IWDT_IWDTSR    ((volatile unsigned short *)(IWDTBASE + 0x04))  // WDT Status Register

// 8 bit registers
#define IWDT_IWDTRR    ((volatile unsigned char  *)(IWDTBASE + 0x00))  // WDT Refresh Register


// ==== 28. Serial Communications Interface (SCI) ====
#define SCIBASE 0x40070000
// Receive Data Register
#define SCI0_RDR ((volatile unsigned char  *)(SCIBASE + 0x0005))
#define SCI1_RDR ((volatile unsigned char  *)(SCIBASE + 0x0025))
#define SCI2_RDR ((volatile unsigned char  *)(SCIBASE + 0x0045))
#define SCI9_RDR ((volatile unsigned char  *)(SCIBASE + 0x0125))
// Receive 9-bit Data Register
#define SCI0_RDRHL ((volatile unsigned short *)(SCIBASE + 0x0010))
#define SCI1_RDRHL ((volatile unsigned short *)(SCIBASE + 0x0030))
#define SCI2_RDRHL ((volatile unsigned short *)(SCIBASE + 0x0050))
#define SCI9_RDRHL ((volatile unsigned short *)(SCIBASE + 0x0130))
// Receive FIFO Data Register H
#define SCI0_FRDRH ((volatile unsigned char *)(SCIBASE + 0x0010))
#define SCI1_FRDRH ((volatile unsigned char *)(SCIBASE + 0x0030))
// Receive FIFO Data Register L
#define SCI0_FRDRL ((volatile unsigned char *)(SCIBASE + 0x0011))
#define SCI1_FRDRL ((volatile unsigned char *)(SCIBASE + 0x0031))
// Receive FIFO Data Register HL
#define SCI0_FRDRHL ((volatile unsigned short *)(SCIBASE + 0x0010))
#define SCI1_FRDRHL ((volatile unsigned short *)(SCIBASE + 0x0030))
// Transmit Data Register
#define SCI0_TDR ((volatile unsigned char  *)(SCIBASE + 0x0003))
#define SCI1_TDR ((volatile unsigned char  *)(SCIBASE + 0x0023))
#define SCI2_TDR ((volatile unsigned char  *)(SCIBASE + 0x0043))
#define SCI9_TDR ((volatile unsigned char  *)(SCIBASE + 0x0123))
// Transmit 9-bit Data Register
#define SCI0_TDRHL ((volatile unsigned short *)(SCIBASE + 0x000E))
#define SCI1_TDRHL ((volatile unsigned short *)(SCIBASE + 0x002E))
#define SCI2_TDRHL ((volatile unsigned short *)(SCIBASE + 0x004E))
#define SCI9_TDRHL ((volatile unsigned short *)(SCIBASE + 0x012E))
// Transmit FIFO Data Register H
#define SCI0_FTDRH ((volatile unsigned char *)(SCIBASE + 0x000E))
#define SCI1_FTDRH ((volatile unsigned char *)(SCIBASE + 0x002E))
// Transmit FIFO Data Register L
#define SCI0_FTDRL ((volatile unsigned char *)(SCIBASE + 0x000F))
#define SCI1_FTDRL ((volatile unsigned char *)(SCIBASE + 0x002F))
// Transmit FIFO Data Register HL
#define SCI0_FTDRHL ((volatile unsigned short *)(SCIBASE + 0x000E))
#define SCI1_FTDRHL ((volatile unsigned short *)(SCIBASE + 0x002E))
// Serial Mode Register
#define SCI0_SMR ((volatile unsigned char  *)(SCIBASE + 0x0000))
#define SCI1_SMR ((volatile unsigned char  *)(SCIBASE + 0x0020))
#define SCI2_SMR ((volatile unsigned char  *)(SCIBASE + 0x0040))
#define SCI9_SMR ((volatile unsigned char  *)(SCIBASE + 0x0120))
#define SCI_CKS_1_0  0  // Clock Select
#define SCI_MP       2  // Multi-Processor Mode
#define SCI_STOP     3  // Stop Bit Length
#define SCI_PM       4  // Parity Mode
#define SCI_PE       5  // Parity Enable
#define SCI_CHR      6  // Character Length (default 8 bit), in combination with the CHR1 bit in SCMR
#define SCI_CM       7  // Communication Mode
// Serial Control Register
#define SCI0_SCR ((volatile unsigned char  *)(SCIBASE + 0x0002))
#define SCI1_SCR ((volatile unsigned char  *)(SCIBASE + 0x0022))
#define SCI2_SCR ((volatile unsigned char  *)(SCIBASE + 0x0042))
#define SCI9_SCR ((volatile unsigned char  *)(SCIBASE + 0x0122))
#define SCR_CKE_1_0  0  // Clock Enable
#define SCR_TEIE     2  // Transmit End Interrupt Enable
#define SCR_MPIE     3  // Multi-Processor Interrupt Enable
#define SCR_RE       4  // Receive Enable
#define SCR_TE       5  // Transmit Enable
#define SCR_RIE      6  // Receive Interrupt Enable
#define SCR_TIE      7  // Transmit Interrupt Enable
// Serial Status Register
#define SCI0_SSR ((volatile unsigned char  *)(SCIBASE + 0x0004))
#define SCI1_SSR ((volatile unsigned char  *)(SCIBASE + 0x0024))
#define SCI2_SSR ((volatile unsigned char  *)(SCIBASE + 0x0044))
#define SCI9_SSR ((volatile unsigned char  *)(SCIBASE + 0x0124))
#define SSR_TEND      2  // Transmit End Flag
#define SSR_RDRF      6  // Receive Data Full Flag
#define SSR_TDRE      7  // Transmit Data Empty Flag
// Serial Status Register FIFO
#define SCI0_SSR_FIFO ((volatile unsigned char  *)(SCIBASE + 0x0004))
#define SCI1_SSR_FIFO ((volatile unsigned char  *)(SCIBASE + 0x0024))
#define SSR_DR        0  // Receive Data Ready Flag
#define SSR_TEND      2  // Transmit End Flag
#define SSR_RDF       6  // Receive FIFO Data Full Flag
#define SSR_TDFE      7  // Transmit FIFO Data Empty Flag
// Smart Card Mode Register - and other settings
#define SCI0_SCMR ((volatile unsigned char  *)(SCIBASE + 0x0006))
#define SCI1_SCMR ((volatile unsigned char  *)(SCIBASE + 0x0026))
#define SCI2_SCMR ((volatile unsigned char  *)(SCIBASE + 0x0046))
#define SCI9_SCMR ((volatile unsigned char  *)(SCIBASE + 0x0126))
#define SCMR_SMIF     0  // Smart Card Interface Mode Select; 0: Non-smart card interface mode
#define SCMR_SINV     2  // Transmitted/Received Data Invert
#define SCMR_SDIR     3  // Transmitted/Received Data Transfer Direction
#define SCMR_CHR1     4  // Character Length 1
#define SCMR_BCP2     7  // Base Clock Pulse 2
// Bit Rate Register
#define SCI0_BRR ((volatile unsigned char  *)(SCIBASE + 0x0001))
#define SCI1_BRR ((volatile unsigned char  *)(SCIBASE + 0x0021))
#define SCI2_BRR ((volatile unsigned char  *)(SCIBASE + 0x0041))
#define SCI9_BRR ((volatile unsigned char  *)(SCIBASE + 0x0121))
// Modulation Duty Register
#define SCI0_MDDR ((volatile unsigned char  *)(SCIBASE + 0x0012))
#define SCI1_MDDR ((volatile unsigned char  *)(SCIBASE + 0x0032))
#define SCI2_MDDR ((volatile unsigned char  *)(SCIBASE + 0x0052))
#define SCI9_MDDR ((volatile unsigned char  *)(SCIBASE + 0x0132))
// Serial Extended Mode Register
#define SCI0_SEMR ((volatile unsigned char  *)(SCIBASE + 0x0007))
#define SCI1_SEMR ((volatile unsigned char  *)(SCIBASE + 0x0027))
#define SCI2_SEMR ((volatile unsigned char  *)(SCIBASE + 0x0047))
#define SCI9_SEMR ((volatile unsigned char  *)(SCIBASE + 0x0127))
#define SEMR_BRME     2  // Bit Rate Modulation Enable
#define SEMR_ABCSE    3  // Asynchronous Mode Extended Base Clock Select 1
#define SEMR_ABCS     4  // Asynchronous Mode Base Clock Select
#define SEMR_NFEN     5  // Digital Noise Filter Function Enable
#define SEMR_BGDM     6  // Baud Rate Generator Double-Speed Mode Select
#define SEMR_RXDESEL  7  // Asynchronous Start Bit Edge Detection Select
// Noise Filter Setting Register
#define SCI0_SNFR ((volatile unsigned char  *)(SCIBASE + 0x0008))
#define SCI1_SNFR ((volatile unsigned char  *)(SCIBASE + 0x0028))
#define SCI2_SNFR ((volatile unsigned char  *)(SCIBASE + 0x0048))
#define SCI9_SNFR ((volatile unsigned char  *)(SCIBASE + 0x0128))
// Line Status Register
#define SCI0_LSR ((volatile unsigned short *)(SCIBASE + 0x0018))
#define SCI1_LSR ((volatile unsigned short *)(SCIBASE + 0x0038))
// Serial Port Register
#define SCI0_SPTR ((volatile unsigned char  *)(SCIBASE + 0x001C))
#define SCI1_SPTR ((volatile unsigned char  *)(SCIBASE + 0x003C))
#define SCI2_SPTR ((volatile unsigned char  *)(SCIBASE + 0x005C))
#define SCI9_SPTR ((volatile unsigned char  *)(SCIBASE + 0x013C))



// ==== 29. I2C Bus Interface ====
#define IICBASE 0x40050000
// I2C Bus Control Register 1
#define IIC0_ICCR1 ((volatile unsigned char  *)(IICBASE + 0x3000))
#define IIC1_ICCR1 ((volatile unsigned char  *)(IICBASE + 0x3100)) // 0x9F
#define ICCR1_SDAI     0  // SDA Line Monitor - R
#define ICCR1_SCLI     1  // SCL Line Monitor - R
#define ICCR1_SDAO     2  // SDA Output Control/Monitor - R/W
#define ICCR1_SCLO     3  // SCL Output Control/Monitor - R/W
#define ICCR1_SOWP     4  // SCLO/SDAO Write Protect
#define ICCR1_CLO      5  // Extra SCL Clock Cycle Output
#define ICCR1_IICRST   6  // I2C Bus Interface Internal Reset
#define ICCR1_ICE      7  // I2C Bus Interface Enable
// I2C Bus Control Register 2
#define IIC0_ICCR2 ((volatile unsigned char  *)(IICBASE + 0x3001))
#define IIC1_ICCR2 ((volatile unsigned char  *)(IICBASE + 0x3101)) // 0x00
#define ICCR2_ST       1  // Start Condition Issuance Request
#define ICCR2_RS       2  // Restart Condition Issuance Request
#define ICCR2_SP       3  // Stop Condition Issuance Request
#define ICCR2_TRS      5  // Transmit/Receive Mode
#define ICCR2_MST      6  // Master/Slave Mode
#define ICCR2_BBSY     7  // Bus Busy Detection Flag
// I2C Bus Mode Register 1
#define IIC0_ICMR1 ((volatile unsigned char  *)(IICBASE + 0x3002))
#define IIC1_ICMR1 ((volatile unsigned char  *)(IICBASE + 0x3102)) // 0x28
#define ICMR1_BC_2_0   0  // Bit Counter
#define ICMR1_BCWP     3  // BC Write Protect
#define ICMR1_CKS_2_0  4  // Internal Reference Clock Select
#define ICMR1_MTWP     7  // MST/TRS Write Protect
// I2C Bus Mode Register 2
#define IIC0_ICMR2 ((volatile unsigned char  *)(IICBASE + 0x3003))
#define IIC1_ICMR2 ((volatile unsigned char  *)(IICBASE + 0x3103)) // 0x05
#define ICMR2_TMOS     0  // Timeout Detection Time Select
#define ICMR2_TMOL     1  // Timeout L Count Control
#define ICMR2_TMOH     2  // Timeout H Count Control
#define ICMR2_SDDL_2_0 4  // SDA Output Delay Counter
#define ICMR2_DLCS     7  // SDA Output Delay Clock Source Select
// I2C Bus Mode Register 3
#define IIC0_ICMR3 ((volatile unsigned char  *)(IICBASE + 0x3004))
#define IIC1_ICMR3 ((volatile unsigned char  *)(IICBASE + 0x3104)) // 0x00
#define ICMR3_NF_1_0   0  // Noise Filter Stage Select
#define ICMR3_ACKBR    2  // Receive Acknowledge
#define ICMR3_ACKBT    3  // Transmit Acknowledge
#define ICMR3_ACKWP    4  // ACKBT Write Protect
#define ICMR3_RDRFS    5  // RDRF Flag Set Timing Select
#define ICMR3_WAIT     6  // WAIT - 0: No WAIT SCLn is not held low during the period between 9th clock cycle and 1ST clock cycle
#define ICMR3_SMBS     7  // SMBus/I2C-Bus Select
// I2C Bus Function Enable Register
#define IIC0_ICFER ((volatile unsigned char  *)(IICBASE + 0x3005))
#define IIC1_ICFER ((volatile unsigned char  *)(IICBASE + 0x3105)) // 0x77
#define ICFER_TMOE     0  // Timeout Function Enable
#define ICFER_MALE     1  // Master Arbitration-Lost Detection Enable
#define ICFER_NALE     2  // NACK Transmission Arbitration-Lost Detection Enable
#define ICFER_SALE     3  // Slave Arbitration-Lost Detection Enable
#define ICFER_NACKE    4  // NACK Reception Transfer Suspension Enable
#define ICFER_NFE      5  // Digital Noise Filter Circuit Enable
#define ICFER_SCLE     6  // SCL Synchronous Circuit Enable
// I2C Bus Status Enable Register
#define IIC0_ICSER ((volatile unsigned char  *)(IICBASE + 0x3006))
#define IIC1_ICSER ((volatile unsigned char  *)(IICBASE + 0x3106)) // 0x00
#define ICSER_SAR0E    0  // Slave Address Register 0 Enable
#define ICSER_SAR1E    1  // Slave Address Register 1 Enable
#define ICSER_SAR2E    2  // Slave Address Register 2 Enable
#define ICSER_GCAE     3  // General Call Address Enable
#define ICSER_DIDE     5  // Device ID Address Detection Enable
#define ICSER_HOAE     7  // Host Address Enable
// I2C Bus Interupt Enable Register
#define IIC0_ICIER ((volatile unsigned char  *)(IICBASE + 0x3007))
#define IIC1_ICIER ((volatile unsigned char  *)(IICBASE + 0x3107)) // 0xB3 Interrupts
#define ICIER_TMOIE    0  // Timeout Interrupt Request Enable
#define ICIER_ALIE     1  // Arbitration-Lost Interrupt Request Enable
#define ICIER_STIE     2  // Start Condition Detection Interrupt Request Enable
#define ICIER_SPIE     3  // Stop Condition Detection Interrupt Request Enable
#define ICIER_NAKIE    4  // NACK Reception Interrupt Request Enable
#define ICIER_RIE      5  // Receive Data Full Interrupt Request Enable
#define ICIER_TEIE     6  // Transmit End Interrupt Request Enable
#define ICIER_TIE      7  // Transmit Data Empty Interrupt Request Enable
// I2C Bus Status Register 1
#define IIC0_ICSR1 ((volatile unsigned char  *)(IICBASE + 0x3008))
#define IIC1_ICSR1 ((volatile unsigned char  *)(IICBASE + 0x3108)) // 0x00
#define ICSR1_AAS0     0  // Slave Address 0 Detection Flag
#define ICSR1_AAS1     1  // Slave Address 1 Detection Flag
#define ICSR1_AAS2     2  // Slave Address 2 Detection Flag
#define ICSR1_GCA      3  // General Call Address Detection Flag
#define ICSR1_DID      5  // Device ID Address Detection Flag
#define ICSR1_HOA      7  // Host Address Detection Flag
// I2C Bus Status Register 2
#define IIC0_ICSR2 ((volatile unsigned char  *)(IICBASE + 0x3009))
#define IIC1_ICSR2 ((volatile unsigned char  *)(IICBASE + 0x3109)) // 0x00
#define ICSR2_TMOF     0  // Timeout Detection Flag
#define ICSR2_AL       1  // Arbitration-Lost Flag
#define ICSR2_START    2  // Start Condition Detection Flag
#define ICSR2_STOP     3  // Stop Condition Detection Flag
#define ICSR2_NACKF    4  // NACK Detection Flag
#define ICSR2_RDRF     5  // Receive Data Full Flag
#define ICSR2_TEND     6  // Transmit End Flag
#define ICSR2_TDRE     7  // Transmit Data Empty Flag
// ...
// I2C Bus Bit Rate Low-Level Register
#define IIC0_ICBRL ((volatile unsigned char  *)(IICBASE + 0x3010))
#define IIC1_ICBRL ((volatile unsigned char  *)(IICBASE + 0x3110)) // 0xFB
#define ICBRL_4_0  0  // Bit Rate Low-Level Period - 5-bits
// I2C Bus Bit Rate High-Level Register
#define IIC0_ICBRH ((volatile unsigned char  *)(IICBASE + 0x3011))
#define IIC1_ICBRH ((volatile unsigned char  *)(IICBASE + 0x3111)) // 0xFA
#define ICBRH_4_0  0  // Bit Rate High-Level Period
// ...
// I2C Bus Transmit Data Register
#define IIC0_ICDRT ((volatile unsigned char  *)(IICBASE + 0x3012))
#define IIC1_ICDRT ((volatile unsigned char  *)(IICBASE + 0x3112))
// I2C Bus Receive Data Register
#define IIC0_ICDRR ((volatile unsigned char  *)(IICBASE + 0x3013))
#define IIC1_ICDRR ((volatile unsigned char  *)(IICBASE + 0x3113))

// Slave Address Register L0-2
#define IIC0_SARL0 ((volatile unsigned char  *)(IICBASE + 0x300A))
#define IIC1_SARL0 ((volatile unsigned char  *)(IICBASE + 0x310A))
#define IIC0_SARL1 ((volatile unsigned char  *)(IICBASE + 0x300C))
#define IIC1_SARL1 ((volatile unsigned char  *)(IICBASE + 0x310C))
#define IIC0_SARL2 ((volatile unsigned char  *)(IICBASE + 0x300E))
#define IIC1_SARL2 ((volatile unsigned char  *)(IICBASE + 0x310E))
#define SARL_SVA0    0  // 10-Bit Address LSB
#define SARL_SVA_6_0 1  // 7-Bit Address/10-Bit Address Lower Bits
// Slave Address Register U0-2
#define IIC0_SARU0 ((volatile unsigned char  *)(IICBASE + 0x300B))
#define IIC1_SARU0 ((volatile unsigned char  *)(IICBASE + 0x310B))
#define IIC0_SARU1 ((volatile unsigned char  *)(IICBASE + 0x300D))
#define IIC1_SARU1 ((volatile unsigned char  *)(IICBASE + 0x310D))
#define IIC0_SARU2 ((volatile unsigned char  *)(IICBASE + 0x300F))
#define IIC1_SARU2 ((volatile unsigned char  *)(IICBASE + 0x310F))
#define SARU_FS      0  // 7-Bit/10-Bit Address Format Select - 0: 7-bit
#define SARU_SVA_1_0 1  // 10-Bit Address Upper Bits

// I2C Bus Wakeup Unit Register
#define IIC0_ICWUR  ((volatile unsigned char  *)(IICBASE + 0x3016))
#define ICWUR_WUAFA     0  // Wakeup Analog Filter Additional Selection
#define ICWUR_WUACK     4  // ACK bit for Wakeup Mode
#define ICWUR_WUF       5  // Wakeup Event Occurrence Flag
#define ICWUR_WUIE      6  // Wakeup Interrupt Request Enable
#define ICWUR_WUE       7  // Wakeup Function Enable
// I2C Bus Wakeup Unit Register
#define IIC0_ICWUR2 ((volatile unsigned char  *)(IICBASE + 0x3017))
#define ICWUR2_WUSEN    0  // Wake-up Function Synchronous Enable
#define ICWUR2_WUASYF   1  // Wake-up Function Asynchronous Operation Status Flag
#define ICWUR2_WUSFY    2  // Wake-up Function Synchronous Operation Status Flag


