TriodeGirl/RA4M1_Arduino_UNO-R4_Processor_Direct_Register_Addressing_Defines/susan_ra4m1_minima_register_defines.h
// ==== 31. Serial Peripheral Interface (SPI) ====
#define SPIBASE 0x40070000
// SPI Control Register
#define SPI0_SPCR    ((volatile unsigned char  *)(SPIBASE + 0x2000))
#define SPI1_SPCR    ((volatile unsigned char  *)(SPIBASE + 0x2100))
#define SPCR_SPMS   0  // SPI Mode Select
#define SPCR_TXMD   1  // Communications Operating Mode
#define SPCR_MODFEN 2  // Mode Fault Error Detection Enable
#define SPCR_MSTR   3  // SPI Master/Slave Mode Select
#define SPCR_SPEIE  4  // SPI Error Interrupt Enable
#define SPCR_SPTIE  5  // Transmit Buffer Empty Interrupt Enable
#define SPCR_SPE    6  // SPI Function Enable
#define SPCR_SPRIE  7  // SPI Receive Buffer Full Interrupt Enable
// SPI Slave Select Polarity Register
#define SPI0_SSLP    ((volatile unsigned char  *)(SPIBASE + 0x2001))
#define SPI1_SSLP    ((volatile unsigned char  *)(SPIBASE + 0x2101))
#define SSLP_SSL0P  0  // SSL0 Signal Polarity Setting
#define SSLP_SSL1P  1  // SSL1 Signal Polarity Setting
#define SSLP_SSL2P  2  // SSL2 Signal Polarity Setting
#define SSLP_SSL3P  3  // SSL3 Signal Polarity Setting
// SPI Pin Control Register
#define SPI0_SPPCR   ((volatile unsigned char  *)(SPIBASE + 0x2002))
#define SPI1_SPPCR   ((volatile unsigned char  *)(SPIBASE + 0x2102))
#define SPPCR_SPLP   0  // SPI Loopback - data inverted
#define SPPCR_SPLP2  1  // SPI Loopback 2 - data not inverted
#define SPPCR_MOIFV  4  // MOSI Idle Fixed Value
#define SPPCR_MOIFE  5  // MOSI Idle Value Fixing Enable
// SPI Status Register
#define SPI0_SPSR    ((volatile unsigned char  *)(SPIBASE + 0x2003))
#define SPI1_SPSR    ((volatile unsigned char  *)(SPIBASE + 0x2103))
#define SPSR_OVRF   0  // Overrun Error Flag
#define SPSR_IDLNF  1  // SPI Idle Flag
#define SPSR_MODF   2  // Mode Fault Error Flag
#define SPSR_PERF   3  // Parity Error Flag
#define SPSR_UDRF   4  // Underrun Error Flag
#define SPSR_SPTEF  5  // SPI Transmit Buffer Empty Flag
#define SPSR_SPRF   7  // SPI Receive Buffer Full Flag
// SPI Data Register
#define SPI0_SPDR    ((volatile unsigned int   *)(SPIBASE + 0x2004))
#define SPI1_SPDR    ((volatile unsigned int   *)(SPIBASE + 0x2104))
#define SPI0_SPDR_HA ((volatile unsigned short *)(SPIBASE + 0x2004))
#define SPI1_SPDR_HA ((volatile unsigned short *)(SPIBASE + 0x2104))
// SPI Bit Rate Register
#define SPI0_SPBR    ((volatile unsigned char  *)(SPIBASE + 0x200A))
#define SPI1_SPBR    ((volatile unsigned char  *)(SPIBASE + 0x210A))
#define SPBR_0_7     0  // 0x00 = 24MHz; 0x01 = 12MHz; 0x02 = 8.0MHz; 0x03 = 6.0MHz; 0x04 = 4.8MHz; 0x05 = 4.0MHz
#define SPI_BR_24MHz  0x00
#define SPI_BR_12MHz  0x01
#define SPI_BR_8M0Hz  0x02
#define SPI_BR_6M0Hz  0x03
#define SPI_BR_4M8Hz  0x04
#define SPI_BR_4M0Hz  0x05
// SPI Data Control Register
#define SPI0_SPDCR   ((volatile unsigned char  *)(SPIBASE + 0x200B))
#define SPI1_SPDCR   ((volatile unsigned char  *)(SPIBASE + 0x210B))
#define SPDCR_SPRDTD 4  // SPI Receive/Transmit Data Select
#define SPDCR_SPLW   5  // SPI Word Access/Halfword Access Specification
// SPI Clock Delay Register
#define SPI0_SPCKD   ((volatile unsigned char  *)(SPIBASE + 0x200C))
#define SPI1_SPCKD   ((volatile unsigned char  *)(SPIBASE + 0x210C))
// SPI Slave Select Negation Delay Register
#define SPI0_SSLND   ((volatile unsigned char  *)(SPIBASE + 0x200D))
#define SPI1_SSLND   ((volatile unsigned char  *)(SPIBASE + 0x210D))
// SPI Next-Access Delay Register
#define SPI0_SPND    ((volatile unsigned char  *)(SPIBASE + 0x200E))
#define SPI1_SPND    ((volatile unsigned char  *)(SPIBASE + 0x210E))
// SPI Control Register 2
#define SPI0_SPCR2   ((volatile unsigned char  *)(SPIBASE + 0x200F))
#define SPI1_SPCR2   ((volatile unsigned char  *)(SPIBASE + 0x210F))
#define SPCR2_SPPE   0  // Parity Enable
#define SPCR2_SPOE   1  // Parity Mode
#define SPCR2_SPIIE  2  // SPI Idle Interrupt Enable
#define SPCR2_PTE    3  // Parity Self-Testing
#define SPCR2_SCKASE 4  // RSPCK Auto-Stop Function Enable
// SPI Command Register 0
#define SPI0_SPCMD0  ((volatile unsigned short *)(SPIBASE + 0x2010))
#define SPI1_SPCMD0  ((volatile unsigned short *)(SPIBASE + 0x2110))
#define SPCMD0_CPHA      0  // RSPCK Phase Setting
#define SPCMD0_CPOL      1  // RSPCK Polarity Setting
#define SPCMD0_BRDV_0_1  2  // Bit Rate Division Setting
#define SPCMD0_SSLA_0_2  4  // SSL Signal Assertion Setting
#define SPCMD0_SPB_0_3   8  // SPI Data Length Setting
#define SPCMD0_LSBF     12  // SPI LSB First
#define SPCMD0_SPNDEN   13  // SPI Next-Access Delay Enable
#define SPCMD0_SLNDEN   14  // SSL Negation Delay Setting Enable
#define SPCMD0_SCKDEN   15  // RSPCK Delay Setting Enable
#define SPI_BITS_08 0b0100 // 8 bits
#define SPI_BITS_09 0b1000 // 9 bits
#define SPI_BITS_10 0b1001 // 10 bits
#define SPI_BITS_11 0b1010 // 11 bits
#define SPI_BITS_12 0b1011 // 12 bits
#define SPI_BITS_13 0b1100 // 13 bits
#define SPI_BITS_14 0b1101 // 14 bits
#define SPI_BITS_15 0b1110 // 15 bits
#define SPI_BITS_16 0b1111 // 16 bits
#define SPI_BITS_20 0b0000 // 20 bits
#define SPI_BITS_24 0b0001 // 24 bits
#define SPI_BITS_32 0b0010 // 32 bits.
#define SPI_MASTER 1
#define SPI_SLAVE  0
#define SPI_IRQEN  1
#define SPI_POLL   0
#define SPI1       1
#define SPI0       0


// Serial Sound Interface Enhanced (SSIE)
#define AUDIO_DATA_SIGNED  // I2S audio data is signed

#define SSIEBASE 0x40040000          // SSIE Base - Bit Clock output on D10
#define SSIE0_SSICR  ((volatile unsigned int *)(SSIEBASE + 0xE000))   // Control Register
#define SSICR_REN        0  // 1: Enable reception.
#define SSICR_TEN        1  // 1: Enable transmission.
#define SSICR_MUEN       3  // 1: Enable muting
#define SSICR_CKDV_3_0   4  // 1: Select Bit Clock Division Ratio
#define SSICR_DEL        8  // 0: Delay of 1 cycle of SSIBCK; 1: No delay
#define SSICR_PDTA       9  // Select Placement Data Alignment
#define SSICR_SDTA      10  // Select Serial Data Alignment
#define SSICR_SPDP      11  // Select Serial Padding Polarity
#define SSICR_LRCKP     12  // Select the Initial Value and Polarity of LR Clock/Frame
#define SSICR_BCKP      13  // Select Bit Clock Polarity
#define SSICR_MST       14  // Master Enable
#define SSICR_SWL_2_0   16  // Select System Word Length
#define SSICR_DWL_2_0   19  // Select Data Word Length
#define SSICR_IIEN      25  // Idle Mode Interrupt Output Enable
#define SSICR_ROIEN     26  // Receive Overflow Interrupt Output Enable
#define SSICR_RUIEN     27  // Receive Underflow Interrupt Output Enable
#define SSICR_TOIEN     28  // Transmit Overflow Interrupt Output Enable
#define SSICR_TUIEN     29  // transmit Underflow Interrupt Output Enable
#define SSICR_CKS       30  // Select Audio Clock for Master mode - 0: AUDIO_CLK, 1: GTIOC1A (GPT output).
#define SSIE0_SSISR  ((volatile unsigned int *)(SSIEBASE + 0xE004))   // Status Register (SSISR)
#define SSISR_IIRQ      25  // Idle Mode Status Flag
#define SSISR_ROIRQ     26  // Receive Overflow Error Status Flag
#define SSISR_RUIRQ     27  // Receive Underflow Error Status Flag
#define SSISR_TOIRQ     28  // Transmit Overflow Error Status Flag
#define SSISR_TUIRQ     29  // transmit Underflow Error Status Flag
#define SSIE0_SSIFCR ((volatile unsigned int *)(SSIEBASE + 0xE010))   // FIFO Control Register
#define SSIFCR_RFRST     0  // 1: Set a receive data FIFO reset condition.
#define SSIFCR_TFRST     1  // 1: Set a transmit data FIFO reset condition.
#define SSIFCR_RIE       2  // 1: Enable receive data full interrupts.
#define SSIFCR_TIE       3  // 1: Enable transmit data empty interrupts.
#define SSIFCR_AUCKE    31  // 1: Enable supply of AUDIO_MCK in Master Mode.
#define SSIE0_SSIFSR ((volatile unsigned int *)(SSIEBASE + 0xE014))   // FIFO Status Register
#define SSIFSR_RDF       0  // Receive Data Full Flag
#define SSIFSR_RDC_3_0   8  // Number of receive FIFO data indication flag
#define SSIFSR_TDE      16  // Transmit Data Empty Flag
#define SSIFSR_TDC_3_0  24  // Number of transmit FIFO data indication flag
#ifdef AUDIO_DATA_SIGNED
#define SSIE0_SSIFTDR    ((volatile signed int   *)(SSIEBASE + 0xE018))  // Transmit FIFO Data Register - 18 to 32 bit
#define SSIE0_SSIFTDR_HA ((volatile signed short *)(SSIEBASE + 0xE018))  // Transmit FIFO Data Register - 16 bit
#define SSIE0_SSIFTDR_BY ((volatile signed char  *)(SSIEBASE + 0xE018))  // Transmit FIFO Data Register - 8 bit
#define SSIE0_SSIFRDR    ((volatile signed int   *)(SSIEBASE + 0xE01C))  // Receive FIFO Data Register
#define SSIE0_SSIFRDR_HA ((volatile signed short *)(SSIEBASE + 0xE01C))  // Receive FIFO Data Register
#define SSIE0_SSIFRDR_BY ((volatile signed char  *)(SSIEBASE + 0xE01C))  // Receive FIFO Data Register
#else
#define SSIE0_SSIFTDR    ((volatile unsigned int   *)(SSIEBASE + 0xE018))  // Transmit FIFO Data Register - 18 to 32 bit
#define SSIE0_SSIFTDR_HA ((volatile unsigned short *)(SSIEBASE + 0xE018))  // Transmit FIFO Data Register - 16 bit
#define SSIE0_SSIFTDR_BY ((volatile unsigned char  *)(SSIEBASE + 0xE018))  // Transmit FIFO Data Register - 8 bit
#define SSIE0_SSIFRDR    ((volatile unsigned int   *)(SSIEBASE + 0xE01C))  // Receive FIFO Data Register
#define SSIE0_SSIFRDR_HA ((volatile unsigned short *)(SSIEBASE + 0xE01C))  // Receive FIFO Data Register
#define SSIE0_SSIFRDR_BY ((volatile unsigned char  *)(SSIEBASE + 0xE01C))  // Receive FIFO Data Register
#endif
#define SSIE0_SSITDMR    ((volatile unsigned int   *)(SSIEBASE + 0xE020))  // TDM Mode Register
#define SSITDMR_OMOD_1_0 0  // Audio Format Select; 00: I2S format, 10: Monaural format
#define SSITDMR_LRCONT   8  // 1: Enables LRCK/FS continuation
#define SSITDMR_BCKASTP  9  // 0: Always outputs BCK to the SSIBCK pin, 1: Automatically controls output
#define SSIE0_SSISCR  ((volatile unsigned int *)(SSIEBASE + 0xE024))   //  Status Control Register
#define SSISCR_RDFS_2_0  0  // RDF Setting Condition; 000: SSIFRDR has one... stage of data, to 111: SSIFRDR has eight
#define SSISCR_TDFS_2_0  8  // TDE Setting Condition; 000: SSIFTDR has one... stage of free space, to 111: SSIFTDR has eight


// 27. USB 2.0 Full-Speed Module (USBFS) - Partial fragment to check configs - and enable USB module to be turned off
#define USBFSBASE 0x40090000          // USBFS Base
#define USBFS_SYSCFG  ((volatile unsigned short *)(USBFSBASE + 0x0000))   // System Configuration Control Register
#define SYSCFG_USBE     0  // USBFS Operation Enable; 0: Disabled, 1: Enabled
#define SYSCFG_SCKE    10  // USB Clock Enable
#define USBFS_INTENB0 ((volatile unsigned short *)(USBFSBASE + 0x0030))   // Interrupt Enable Register 0
#define INTENB0_VBSE   15  // VBUS Interrupt Enable; 0: Interrupt output disabled, 1: ... enabled

